# Data & Analytics - 7/10

In [1]:
import pandas as pd

df = pd.read_csv('dataset/actors.csv')
df.head()

,Actor,Total Gross,Number of Movies,Average per Movie,#1 Movie,Gross
0,Harrison Ford,4871.7,41,118.8,Star Wars: The Force Awakens,936.7
1,Samuel L. Jackson,4772.8,69,69.2,The Avengers,623.4
2,Morgan Freeman,4468.3,61,73.3,The Dark Knight,534.9
3,Tom Hanks,4340.8,44,98.7,Toy Story 3,415.0
4,"Robert Downey, Jr.",3947.3,53,74.5,The Avengers,623.4

### Rename Columns

In [3]:
df = df.rename(columns={'#1 Movie': 'Movie'})

### Describe Columns

In [66]:
df.describe().round(2)

       Total Gross  Number of Movies  Average per Movie   Gross
count        50.00             50.00              50.00   50.00
mean       3034.09             37.88              93.52  428.69
std         591.53             14.12              58.51  184.34
min        2416.50              7.00              39.00  169.70
25%        2612.43             27.50              67.55  279.30
50%        2824.50             37.00              79.05  419.15
75%        3185.80             43.75             100.12  519.80
max        4871.70             79.00             451.80  936.70

#### Identifique o ator/atriz com maior número de filmes e o respectivo número de filmes.

In [44]:
aux = df[['Actor', 'Number of Movies']].groupby('Actor').max().sort_values('Number of Movies', ascending=False).reset_index().head(1)
aux

           Actor  Number of Movies
0  Robert DeNiro                79

#### Apresente a média da coluna contendo o número de filmes.

In [51]:
nom = df['Number of Movies'].mean()
nom

print(f'A media foi de: {nom}')

A media foi de: 37.88

#### Apresente o nome do ator/atriz com a maior média por filme.

In [60]:
aux2 = df[['Actor', 'Average per Movie']].groupby('Actor').mean().sort_values('Average per Movie', ascending=False).reset_index().head(1)
aux2

             Actor  Average per Movie
0  Anthony Daniels              451.8

#### Apresente o nome do(s) filme(s) mais frequente(s) e sua respectiva frequência.

In [7]:
df1 = df[['Actor', 'Movie']].groupby('Movie').count().sort_values('Actor', ascending=False).reset_index()
df1 = df1.rename(columns={'Actor': 'Frequency'})
df1

                                  Movie  Frequency
0                          The Avengers          6
1                         Catching Fire          4
2   Harry Potter / Deathly Hallows (P2)          4
3                       The Dark Knight          3
4                      Meet the Fockers          3
5          Star Wars: The Force Awakens          3
6                    Return of the King          2
7                      Dead Man's Chest          2
8               Avengers: Age of Ultron          2
9                   Night at the Museum          2
10                              Shrek 2          2
11                      American Sniper          1
12                              Titanic          1
13                   The Phantom Menace          1
14                       The LEGO Movie          1
15                          Toy Story 3          1
16                       Transformers 4          1
17                    War of the Worlds          1
18                          The Martian          1
19                          Sixth Sense          1
20                           The Grinch          1
21                The Dark Knight Rises          1
22                       Ocean's Eleven          1
23                              Minions          1
24                         Men in Black          1
25                     Independence Day          1
26                 Hotel Transylvania 2          1
27                          World War Z          1